package package_Main;



import package_VO.UserVO;

public class View {
	/**
	 * 메인뷰
	 * 
	 * @author 홍유리
	 * 
	 */
	void startMethod(){
		String message = "";
		while (true) {
			System.out.println("┌─────────────────────────────┐");
			System.out.println("| ┌──────────────────────────┐|");
			System.out.println("	   이북사이트에 오신걸 환영합니다.   ");
			System.out.println("| └──────────────────────────┘ ");
			System.out.println("└─────────────────────────────┘");
		}
		
	/**
	 * 관리자 메인뷰 - 관리자 메서드	
	 */
		
		//대출 목록 조회
		
		//보유 도서 조회-도서 추가, 상세정보 수정,삭제
		
		//회원 목록 조회- 회원 상세 조회
		
		//공지 목록 조회- 공지 추가, 상세정보 수정,삭제
		
		//이용권 조회 - 이용권 추가, 상세정보 수정, 삭제
		
		//매출 조회  -일,월,년 매출 조회
		
	/**
	 * 	회원 메인뷰 - 회원 메서드
	 */
		//공지사항 확인 - 공지상세 정보 확인
		
		//돈 충전
		
		//이용권 조회 - 이용권 구매
		
		// 도서 검색 - 대여하기
		
		// 대여목록 조회 -대여 상세 정보 조회 - 평점달기
		
		// 내정보 수정 -이름 변경, 비밀번호 변경, 회원  탈퇴
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}
}


	